kateloop/453-project/PIC18/code/main.c
        // USE FOLLOWING CODE TO CALIBRATE
    while (1) {
        char uout;
        char hResult;
        char lResult;

        uout = 0xee;
        TXREG = uout;
        while((PIR1 & 0b00010000) == 0);

        
        ADON = 0;   // Turn off ADC

        ADRESH = 0x00; // reset result registers
        ADRESL = 0x00;
        ADCON0 = ADCON0_CHAND;
        // Start conversion and wait for result
        ADON = 1;   // Turn on ADC
        GODONE = 1; // Starts conversion

        // Wait for conversion to finish
        while (GODONE);
        hResult = ADRESH;
        lResult = ADRESL;
        
        uout = hResult;
        TXREG = uout;
        while((PIR1 & 0b00010000) == 0);
        uout = lResult;
        TXREG = uout;
        while((PIR1 & 0b00010000) == 0);

        DelayMs(5000);
        DelayMs(5000);
    }


    




    while (0) {  
        // wait until sensor value changes 
        while (change_val == 0) {
            // spin
            continue;
        }

        // once note changes, send data across UART and light LEDs
        uart_out = cur_inputs[index];
        TXREG = uart_out;
        while((PIR1 & 0b00010000) == 0);
        
        ToggleLeds();

        // Reset Change Val
        change_val = 0;

    }
    
   /*  
        testToggle(); 
   */

     return (EXIT_SUCCESS);
}


//////////////////////////////////////////////
//  Function to Toggle LEDs according to    //
//  notes being played.                     //
//////////////////////////////////////////////

// N channels enabled by 1
// P channels enabled by 0
void ToggleLeds () {

    // Look at array containing LED Info and toggle LEDs accordingly

    // Octave 3
    if (led_array[4] == 1 && led_array[5] == 1 && led_array[6] == 1) {
        // Octave 3 L & R LED on; C
        //LATA   -P-P----
        LATA = 0b11101111;
        //LATB   PNN-NN--
        LATB = 0b11100000;
        //LATB   --NNPPPP
        LATC = 0b00001111;
    } else if (led_array[4] == 1 && led_array[5] == 1 && led_array[7] == 1) {
        // Octave 3 L & R LED on; D
        //LATA   -P-P----
        LATA = 0b10111111;
        //LATB   PNN-NN--
        LATB = 0b11100000;
        //LATB   --NNPPPP
        LATC = 0b00001111;
    } else if (led_array[4] == 1 && led_array[5] == 1 && led_array[8] == 1) {
        // Octave 3 L & R LED on; E
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b11100000;
        //LATB   --NNPPPP
        LATC = 0b00001110;
    } else if (led_array[4] == 1 && led_array[5] == 1 && led_array[9] == 1) {
        // Octave 3 L & R LED on; F
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b11100000;
        //LATB   --NNPPPP
        LATC = 0b00001101;
    } else if (led_array[4] == 1 && led_array[5] == 1 && led_array[10] == 1) {
        // Octave 3 L & R LED on; G
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b01100000;
        //LATB   --NNPPPP
        LATC = 0b00001111;
    } else if (led_array[4] == 1 && led_array[5] == 1 && led_array[11] == 1) {
        // Octave 3 L & R LED on; A
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b11100000;
        //LATB   --NNPPPP
        LATC = 0b00001011;
    } else if (led_array[4] == 1 && led_array[5] == 1 && led_array[12] == 1) {
       // Octave 5 3 & R LED on; B
       //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b11100000;
        //LATB   --NNPPPP
        LATC = 0b00000111;

    } else if (led_array[4] == 1 && led_array[6] == 1) {
        // Octave 3 Right LED is on; C
        //LATA   -P-P----
        LATA = 0b11101111;
        //LATB   PNN-NN--
        LATB = 0b11000000;
        //LATB   --NNPPPP
        LATC = 0b00001111;
    } else if (led_array[4] == 1 && led_array[7] == 1) {
        // Octave 3 Right LED is on; D
        //LATA   -P-P----
        LATA = 0b10111111;
        //LATB   PNN-NN--
        LATB = 0b11000000;
        //LATB   --NNPPPP
        LATC = 0b00001111;
    } else if (led_array[4] == 1 && led_array[8] == 1) {
        // Octave 3 Right LED is on; E
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b11000000;
        //LATB   --NNPPPP
        LATC = 0b00001110;
    } else if (led_array[4] == 1 && led_array[9] == 1) {
        // Octave 3 Right LED is on; F
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b11000000;
        //LATB   --NNPPPP
        LATC = 0b00001101;

    } else if (led_array[4] == 1 && led_array[10] == 1) {
        // Octave 3 Right LED is on; G
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b01000000;
        //LATB   --NNPPPP
        LATC = 0b00001111;

    } else if (led_array[4] == 1 && led_array[11] == 1) {
        // Octave 3 Right LED is on; A
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b11000000;
        //LATB   --NNPPPP
        LATC = 0b00001011;

    } else if (led_array[4] == 1 && led_array[12] == 1) {
        // Octave 3 Right LED is on; B
        //LATA   -P-P----
        LATA = 0b11111111;
        //LATB   PNN-NN--
        LATB = 0b11000000;
        //LATB   --NNPPPP
        LATC = 0b00000111;

    } else if (led_array[5] == 1 && led_array[6] == 1) {
        // Octave 3 Left LED is on; C
        //LATA   -P-P----
        LATA = 0b11101111;
        //LATB   PNN-NN--
        LATB = 0b10100000;
        //LATB   --NNPPPP
        LATC = 0b00001111;

    } else if (led_array[5] == 1 && led_array[7] == 1) {
        // Octave 3 Left LED is on; D
        //LATA   -P-P----
        LATA = 0b10111111;
        //LATB   PNN-NN--
        LATB = 0b10100000;
        //LATB   --NNPPPP
        LATC = 0b00001111;

