kateloop/453-project/PIC18/code/main.c
    // int led_array[13];
    // R5, L5, R4, L4, R3, L3, C, D, E, F, G, A, B

    // toggle octave 5 leds
    for (int i = 0; i < 7; i++) {
        for (int j = 0; j < sizeof(led_array); j++) {
            led_array[j] = 0;
        }
        led_array[0] = 1;
        led_array[1] = 1;
        led_array[i+6] = 1;
        ToggleLeds();
        DelayMs(5000);
    }
    for (int i = 0; i < 7; i++) {
        for (int j = 0; j < sizeof(led_array); j++) {
            led_array[j] = 0;
        }
        led_array[0] = 1;
        led_array[i+6] = 1;
        ToggleLeds();
        DelayMs(5000);
    }
    for (int i = 0; i < 7; i++) {
        for (int j = 0; j < sizeof(led_array); j++) {
            led_array[j] = 0;
        }
        led_array[1] = 1;
        led_array[i+6] = 1;
        ToggleLeds();
        DelayMs(5000);
    }

    // toggle octave 4 leds
    for (int i = 0; i < 7; i++) {
        for (int j = 0; j < sizeof(led_array); j++) {
            led_array[j] = 0;
        }
        led_array[2] = 1;
        led_array[3] = 1;
        led_array[i+6] = 1;
        ToggleLeds();
        DelayMs(5000);
    }
    for (int i = 0; i < 7; i++) {
        for (int j = 0; j < sizeof(led_array); j++) {
            led_array[j] = 0;
        }
        led_array[2] = 1;
        led_array[i+6] = 1;
        ToggleLeds();
        DelayMs(5000);
    }
    for (int i = 0; i < 7; i++) {
        for (int j = 0; j < sizeof(led_array); j++) {
            led_array[j] = 0;
        }
        led_array[3] = 1;
        led_array[i+6] = 1;
        ToggleLeds();
        DelayMs(5000);
    }

    // toggle octave 3 LEDs
    for (int i = 0; i < 7; i++) {
        for (int j = 0; j < sizeof(led_array); j++) {
            led_array[j] = 0;
        }
        led_array[4] = 1;
        led_array[5] = 1;
        led_array[i+6] = 1;
        ToggleLeds();
        DelayMs(5000);
    }
    // toggle octave 3 LEDs
    for (int i = 0; i < 7; i++) {
        for (int j = 0; j < sizeof(led_array); j++) {
            led_array[j] = 0;
        }
        led_array[4] = 1;
        led_array[i+6] = 1;
        ToggleLeds();
        DelayMs(5000);

    }
    // toggle octave 3 LEDs
    for (int i = 0; i < 7; i++) {
        for (int j = 0; j < sizeof(led_array); j++) {
            led_array[j] = 0;
        }
        led_array[5] = 1;
        led_array[i+6] = 1;
        ToggleLeds();
        DelayMs(5000);
    }
}

// ISR that processes ADC data from 7 inputs in a sequential fashion

ISR () {
    // TODO Disable Interrupts

    adc_conversion ();

    cur_inputs[conv_result.adc_channel] = conv_result.result;

    if (cur_inputs[conv_result.adc_channel] != prev_inputs[conv_result.adc_channel]) {
        change_val = 1;
        prev_inputs[conv_result.adc_channel] = cur_inputs[conv_result.adc_channel];
        index = conv_result.adc_channel;
    } else {
        change_val = 0;
    }

    // TODO Reenable Interrupts

}


//////////////////////////////////////////////
// Function that processes ADC data from    //
// 7 inputs in a sequential fashion         //
//////////////////////////////////////////////

void adc_conversion() {

    ADON = 0;   // Turn off ADC

    ADRESH = 0; // reset result registers
    ADRESL = 0;

    // set ADCON0 register, start conversion, write result in new
    switch (adc_num) {
        case ADCCHANA :
            ADCON0 = ADCON0_CHANA;
            break;
        case ADCCHANB :
            ADCON0 = ADCON0_CHANB;
            break;
        case ADCCHANC :
            ADCON0 = ADCON0_CHANC;
            break;
        case ADCCHAND :
            ADCON0 = ADCON0_CHAND;
            break;
        case ADCCHANE :
            ADCON0 = ADCON0_CHANE;
            break;
        case ADCCHANF :
            ADCON0 = ADCON0_CHANF;
            break;
        case ADCCHANG :
            ADCON0 = ADCON0_CHANG;
            break;
    }


    // Start conversion and wait for result
    ADON = 1;   // Turn on ADC
    GODONE = 1; // Starts conversion

    // Wait for conversion to finish
    while (GODONE);
    unsigned char note = getNote(ADRESH, ADRESL);

    // store conversion result
    conv_result.result = note;
    conv_result.adc_channel = adc_num;

    // Increase the number of the ADC for next conversion
    adc_num++;
    if (adc_num >= NUMADCCHAN) {
        adc_num = ADCCHANA;
    }
}


/////////////////////////////////////////
//   Function that determines note
//   to be played and data to send
//   across UART
///////////////////////////////////////////
unsigned char getNote (unsigned char hResult, unsigned char lResult) {
    unsigned char new_note;
    int i = 0;
    for (i = 0; i < 13; i++) {
        led_array[i] = 0;
    }

    if (adc_num == ADCCHANA) {
        if (hResult == 0x00) {
            // no note playing; ignore this sensor result???
            new_note = 0x00;

        } else if (hResult == 0x01) {
            if (lResult >= 0x00 && lResult <= 0x00) {
                // 5AF
                new_note = 0x51;
                led_array[1] = 1;
                led_array[11] = 1;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 5A
                new_note = 0x41;
                led_array[1] = 1;
                led_array[11] = 1;
                led_array[12] = 1;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 5AS
                new_note = 0x49;
                led_array[1] = 1;
                led_array[12] = 1;
            } else {
                // no note playing
                new_note = 0x00;
            }

        } else if (hResult == 0x02) {
            if (lResult >= 0x00 && lResult <= 0x00) {
                // 4AF
                new_note = 0x31;
                led_array[1] = 1;
                led_array[9] = 1;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 4A
                new_note = 0x21;
                led_array[1] = 1;
                led_array[9] = 1;
                led_array[10] = 1;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 4AS
                new_note = 0x29;
                led_array[1] = 1;
                led_array[10] = 1;
            } else {
                // no note playing
                new_note = 0x00;
            }

        } else if (hResult == 0x03) {
            if (lResult >= 0x00 && lResult <= 0x00) {
                // 3AF
                new_note = 0x11;
                led_array[1] = 1;
                led_array[7] = 1;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 3A
                new_note = 0x01;
                led_array[1] = 1;
                led_array[7] = 1;
                led_array[8] = 1;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 3AS
                new_note = 0x09;
                led_array[1] = 1;
                led_array[8] = 1;
            } else {
                // no note playing
                new_note = 0x00;
            }
        }

    } else if (adc_num == ADCCHANB) {
        if (hResult == 0x00) {
            // no note playing
            new_note = 0x00;
        } else if (hResult == 0x01) {
            if (lResult >= 0x00 && lResult <= 0x00) {
                // 5BF
                new_note = 0x52;
                led_array[0] = 1;
                led_array[11] = 1;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 5B
                new_note = 0x42;
                led_array[0] = 1;
                led_array[11] = 1;
                led_array[12] = 1;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 5BS
                new_note = 0x4a;
                led_array[0] = 1;
                led_array[12] = 1;
            } else {
                // no note playing
                new_note = 0x00;
            }

        } else if (hResult == 0x02) {
            if (lResult >= 0x00 && lResult <= 0x00) {
                // 4BF
                new_note = 0x32;
                led_array[0] = 1;
                led_array[9] = 1;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 4B
                new_note = 0x22;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 4BS
                new_note = 0x2a;
                led_array[0] = 1;
                led_array[9] = 1;
                led_array[10] = 1;
            } else {
                // no note playing
                new_note = 0x00;
                led_array[0] = 1;
                led_array[10] = 1;
            }

        } else if (hResult == 0x03) {
            if (lResult >= 0x00 && lResult <= 0x00) {
                // 3BF
                new_note = 0x12;
                led_array[0] = 1;
                led_array[7] = 1;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 3B
                new_note = 0x02;
                led_array[0] = 1;
                led_array[7] = 1;
                led_array[8] = 1;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 3BS
                new_note = 0x0a;
                led_array[0] = 1;
                led_array[8] = 1;
            } else {
                // no note playing
                new_note = 0x00;
            }
        }

    } else if (adc_num == ADCCHANC) {
        if (hResult == 0x00) {
           // No note playing
           new_note = 0x00;
        } else if (hResult == 0x01) {
           if (lResult >= 0x00 && lResult <= 0x00) {
               // 5CF
               new_note = 0x53;
               led_array[6] = 1;
               led_array[11] = 1;
           } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 5C
                new_note = 0x43;
                led_array[6] = 1;
                led_array[11] = 1;
                led_array[12] = 1;
           } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 5CS
                new_note = 0x4b;
                led_array[6] = 1;
               led_array[12] = 1;
           } else {
                // no note playing
                new_note = 0x00;
           }

        } else if (hResult == 0x02) {
            if (lResult >= 0x00 && lResult <= 0x00) {
                // 4CF
                new_note = 0x33;
                led_array[6] = 1;
                led_array[9] = 1;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 4C
                new_note = 0x23;
                led_array[6] = 1;
                led_array[9] = 1;
                led_array[10] = 1;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 4CS
                new_note = 0x2b;
                led_array[6] = 1;
                led_array[10] = 1;
            } else {
                // no note playing
                new_note = 0x00;
            }

        } else if (hResult == 0x03) {
            if (lResult >= 0x00 && lResult <= 0x00) {
                // 3CF
                new_note = 0x13;
                led_array[6] = 1;
                led_array[7] = 1;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 3C
                new_note = 0x03;
                led_array[6] = 1;
                led_array[7] = 1;
                led_array[8] = 1;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 3CS
                new_note = 0x0b;
                led_array[6] = 1;
                led_array[8] = 1;
            } else {
                // no note playing
                new_note = 0x00;
            }
        }

    } else if (adc_num == ADCCHAND) {
        if (hResult == 0x00) {
            // no note playing
            new_note = 0x00;

