kateloop/453-project/PIC18/code/main.c
        } else if (hResult == 0x01) {
            if (lResult >= 0x00 && lResult <= 0x00) {
                // 5DF
                new_note = 0x54;
                led_array[5] = 1;
                led_array[11] = 1;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 5D
                new_note = 0x44;
                led_array[5] = 1;
                led_array[11] = 1;
                led_array[12] = 1;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 5DS
                led_array[5] = 1;
                led_array[12] = 1;
                new_note = 0x4c;
            } else {
                // no note playing
                new_note = 0x00;
            }

        } else if (hResult == 0x02) {
            if (lResult >= 0x00 && lResult <= 0x00) {
                // 4DF
                new_note = 0x34;
                led_array[5] = 1;
                led_array[9] = 1;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 4D
                new_note = 0x24;
                led_array[5] = 1;
                led_array[9] = 1;
                led_array[10] = 1;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 4DS
                new_note = 0x2c;
                led_array[5] = 1;
                led_array[10] = 1;
            } else {
                // no note playing
                new_note = 0x00;
            }

        } else if (hResult == 0x03) {
            if (lResult >= 0x00 && lResult <= 0x00) {
                // 3DF
                new_note = 0x14;
                led_array[5] = 1;
                led_array[7] = 1;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 3D
                new_note = 0x04;
                led_array[5] = 1;
                led_array[7] = 1;
                led_array[8] = 1;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 3DS
                new_note = 0x0c;
                led_array[5] = 1;
                led_array[8] = 1;
            } else {
                // no note playing
                new_note = 0x00;
            }

        }

    } else if (adc_num == ADCCHANE) {
        if (hResult == 0x00) {
            // no note playing
            new_note = 0x00;

        } else if (hResult == 0x01) {
            if (lResult >= 0x00 && lResult <= 0x00) {
                // 5EF
                new_note = 0x55;
                led_array[4] = 1;
                led_array[11] = 1;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 5E
                new_note = 0x45;
                led_array[4] = 1;
                led_array[11] = 1;
                led_array[12] = 1;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 5ES
                new_note = 0x4d;
                led_array[4] = 1;
                led_array[12] = 1;
            } else {
                // no note playing
                new_note = 0x00;
            }

        } else if (hResult == 0x02) {
            if (lResult >= 0x00 && lResult <= 0x00) {
                // 4EF
                new_note = 0x35;
                led_array[4] = 1;
                led_array[9] = 1;

            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 4E
                new_note = 0x25;
                led_array[4] = 1;
                led_array[9] = 1;
                led_array[10] = 1;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 4ES
                new_note = 0x2d;
                led_array[4] = 1;
                led_array[10] = 1;
            } else {
                // no note playing
                new_note = 0x00;
            }

        } else if (hResult == 0x03) {
            if (lResult >= 0x00 && lResult <= 0x00) {
                // 3EF
                new_note = 0x15;
                led_array[4] = 1;
                led_array[7] = 1;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 3E
                new_note = 0x05;
                led_array[4] = 1;
                led_array[7] = 1;
                led_array[8] = 1;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 3ES
                new_note = 0x0d;
                led_array[4] = 1;
                led_array[8] = 1;
            } else {
                // no note playing
                new_note = 0x00;
            }

        }

    } else if (adc_num == ADCCHANF) {
        if (hResult == 0x00) {
           // no note playing
            new_note = 0x00;

        } else if (hResult == 0x01) {
            if (lResult >= 0x00 && lResult <= 0x00) {
                // 5FF
                new_note = 0x56;
                led_array[3] = 1;
                led_array[11] = 1;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 5F
                new_note = 0x46;
                led_array[3] = 1;
                led_array[12] = 1;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 5FS
                new_note = 0x4e;
                led_array[3] = 1;
                led_array[11] = 1;
                led_array[12] = 1;
            } else {
                // no note playing
                new_note = 0x00;
            }

        } else if (hResult == 0x02) {
            if (lResult >= 0x00 && lResult <= 0x00) {
                // 4FF
                new_note = 0x36;
                led_array[3] = 1;
                led_array[9] = 1;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 4F
                new_note = 0x26;
                led_array[3] = 1;
                led_array[9] = 1;
                led_array[10] = 1;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 4FS
                new_note = 0x2e;
                led_array[3] = 1;
                led_array[10] = 1;
            } else {
               // no note playing
                new_note = 0x00;
            }

        } else if (hResult == 0x03) {
            if (lResult >= 0x00 && lResult <= 0x00) {
                // 3FF
                new_note = 0x16;
                led_array[3] = 1;
                led_array[7] = 1;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 3F
                new_note = 0x06;
                led_array[3] = 1;
                led_array[7] = 1;
                led_array[8] = 1;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 3FS
                new_note = 0x0e;
                led_array[3] = 1;
                led_array[8] = 1;
            } else {
                // no note playing
                new_note = 0x00;
            }

