kateloop/453-project/PIC18/code/main.c
        }

    } else if (adc_num == ADCCHANG) {
        if (hResult == 0x00) {
           // no note playing
            new_note = 0x00;

        } else if (hResult == 0x01) {
            if (lResult >= 0x00 && lResult <= 0x00) {
                // 5GF
                new_note = 0x57;
                led_array[2] = 1;
                led_array[11] = 1;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 5G
                new_note = 0x47;
                led_array[2] = 1;
                led_array[11] = 1;
                led_array[12] = 1;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 5GS
                new_note = 0x4f;
                led_array[2] = 1;
                led_array[12] = 1;
            } else {
                // no note playing
                new_note = 0x00;
            }

        } else if (hResult == 0x02) {
            if (lResult >= 0x00 && lResult <= 0x00) {
                // 4GF
                new_note = 0x37;
                led_array[2] = 1;
                led_array[9] = 1;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 4G
                new_note = 0x27;
                led_array[2] = 1;
                led_array[9] = 1;
                led_array[10] = 1;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 4GS
                new_note = 0x2f;
                led_array[2] = 1;
                led_array[10] = 1;
            } else {
                // no note playing
                new_note = 0x00;
            }

        } else if (hResult == 0x03) {
            if (lResult >= 0x00 && lResult <= 0x00) {
                // 3GF
                new_note = 0x17;
                led_array[2] = 1;
                led_array[7] = 1;

            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 3G
                new_note = 0x07;
                led_array[2] = 1;
                led_array[7] = 1;
                led_array[8] = 1;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 3GS
                new_note = 0x0f;
                led_array[2] = 1;
                led_array[8] = 1;
            } else {
                // no note playing
                new_note = 0x00;
            }

        }

    }
    return new_note;
}